       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATHUTILS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  RESULT         PIC 9(5) VALUE ZERO.

       LINKAGE SECTION.
       01  NUM1           PIC 9(5).
       01  NUM2           PIC 9(5).
       01  OUT-RESULT     PIC 9(5).

       PROCEDURE DIVISION USING NUM1 NUM2 OUT-RESULT.
           ADD NUM1 TO NUM2 GIVING RESULT
           MOVE RESULT TO OUT-RESULT
           GOBACK.
